brew "fish"
brew "helix"
brew "zellij"
brew "yazi"
brew "gitui"
brew "just"
brew "mas"
brew "pipx"
brew "marksman"
brew "git-delta"
brew "git"
brew "fzf"
brew "fd"
brew "sd"
brew "rg"
brew "tree"
brew "bat"
brew "typst"
brew "ffmpeg"
brew "yt-dlp"
brew "pandoc"
brew "node"
brew "b2-tools" # backblaze
brew "sst/tap/opencode"
# brew "binutils"  # provides llvm-objdump

# languages
brew "python"
brew "pyright"
brew "ruff"
brew "pyright"
brew "rustup"

cask "karabiner-elements"
cask "alacritty"
cask "font-fira-code-nerd-font"
cask "qbittorrent"
cask "mochi"
cask "iina"
cask "syncthing"
cask "modern-csv"
cask "qlmarkdown"
cask "ogdesign-eagle"
cask "msty"
cask "google-chrome"
cask "jellyfin"
cask "zed"
cask "1password"
cask "netnewswire"

mas "Wipr 2", id: 1662217862
mas "WhatsApp Messenger", id: 310633997
mas "Cake Wallet", id: 1334702542
