# shell
brew "fish"
brew "starship"
brew "zellij"

# editors & tui
brew "helix"
brew "gitui"
brew "yazi"

# git
brew "git"
brew "git-delta"

# file & text utilities
brew "bat"
brew "dust"
brew "eza"
brew "fd"
brew "fzf"
brew "gnu-sed"
brew "jq"
brew "qsv"
brew "ripgrep"
brew "sd"
brew "yq"

# development
brew "just"
brew "dprint"

# languages & toolchains
brew "python"
brew "ruff"
brew "rustup"
brew "markdown-oxide"

# data & network
brew "ffmpeg"
brew "lftp"
brew "tailscale"
brew "yt-dlp"

# package managers
brew "mas"

# ------------------------------------------------------------------------------
# casks
# ------------------------------------------------------------------------------

# terminal & editors
cask "ghostty"
cask "zed"

# browsers
cask "google-chrome"

# productivity
cask "1password"
cask "keepassxc"
cask "karabiner-elements"
cask "syncthing-app"
cask "kitlangton-hex"

# ai
cask "claude"
cask "claude-code@latest"

# media
cask "iina"
cask "netnewswire"
cask "qbittorrent"

# quicklook plugins
cask "qlmarkdown"
cask "syntax-highlight"

# utilities
cask "ogdesign-eagle"
cask "smoothcsv"
cask "tailscale-app"

# fonts
cask "font-fira-code-nerd-font"

# ------------------------------------------------------------------------------
# mac app store
# ------------------------------------------------------------------------------

mas "Amphetamine", id: 937984704
mas "Brother iPrint&Scan", id: 1193539993
mas "Cake Wallet", id: 1334702542
mas "KeePassium", id: 1435127111
mas "Strongbox", id: 897283731
mas "WhatsApp", id: 310633997
mas "Wipr", id: 1662217862
